{
  "title": "Упражнение по работе с буфером обмена",
  "goals": [
    "Практическое освоение взаимодействия с буфером обмена в JavaScript.",
    "Закрепление навыков работы с DOM и событиями onclick."
  ],
  "training_topic": "Интерактивное взаимодействие с буфером обмена, работа с элементами DOM.",
  "required_resources": [
    "HTML-файл с разметкой, предоставленный преподавателем.",
    "Редактор кода (VS Code, Sublime Text и т.д.)."
  ],
  "instructions": [
    "Введение в упражнение:",
    "- Задача состоит в том, чтобы написать JavaScript-код, позволяющий копировать текст в буфер обмена при нажатии на кнопку.",
    "",
    "Шаг 1. Подготовьте рабочую среду:",
    "- Откройте HTML-файл, предоставленный преподавателем, в любом современном браузере.",
    "",
    "Шаг 2. Добавьте обработчик события на кнопку:",
    "- Откройте файл в редакторе кода и добавьте следующий фрагмент внутрь тега `<script>`:",
    {
      "type": "code",
      "title": "Обработчик события на кнопку",
      "code": "function copyToClipboard() { const textToCopy = document.querySelector('.section-text:nth-child(2)'); navigator.clipboard.writeText(textToCopy.textContent.trim()); }"
    },
    "",
    "Шаг 3. Тестирование функционала:",
    "- Сохраните изменения и перезагрузите страницу в браузере.",
    "- Нажмите на кнопку «Копировать» и убедитесь, что текст успешно попадает в буфер обмена.",
    "",
    "Шаг 4. Улучшение и завершение:",
    "- Проверьте корректность работы кода, попробуйте исправить возможные ошибки или усовершенствовать функционал.",
    "",
    "Заключение:",
    "- Вы написали собственный JavaScript-код для взаимодействия с буфером обмена."
  ],
  "reflection_questions": [
    "Какие другие события можно использовать для запуска подобной функции?",
    "Как можно улучшить функционал, чтобы повысить удобство взаимодействия с пользователем?",
    "Какие ограничения имеются у работы с буфером обмена в современных браузерах?"
  ],
  "additional_materials": [
    "Документация MDN по clipboard API: https://developer.mozilla.org/en-US/docs/Web/API/Clipboard_API"
  ],
  "final_conclusion": [
    "Вы освоили механизм взаимодействия с буфером обмена в JavaScript, пополнив свой арсенал знаний важными практическими навыками."
  ]
}