{
  "title": "Моделирование при помощи графов",
  "goals": [
    "Научиться применять процедуру моделирования с помощью графов, описанную в подразделе 3.3.9.",
    "Понять, как строить графы, а именно их графическую часть, от руки на основе чего-то присутствующего в жизни."
  ],
  "training_topic": "Моделирование",
  "required_resources": [
    "Бумага и ручка или графический редактор",
    "Пример структуры данных (будет предоставлен)"
  ],
  "instructions": [
  "Определите, какие есть в вашей квартире объекты (например, комнаты, двери, окна) и отношения между ними (например, связь между комнатами через двери). Это будет вашей системой.",
  "Выберите, что будете принимать за вершины графа. Например, каждая комната может быть вершиной.",
  "Перечислите все вершины (комнаты, коридоры, балкон и т.д.) и расположите их на бумаге так, как они находятся в вашей квартире. Вы можете использовать кружки или прямоугольники для обозначения вершин.",
  "Если вы хотите добавить значения (например, площадь комнаты, температура, уровень освещенности), запишите их рядом с вершиной или внутри нее. Тогда ваш граф станет взвешенным.",
  "Определите, какие связи существуют между комнатами (например, дверь соединяет гостиную и кухню). Проведите рёбра или дуги между соответствующими вершинами.",
  "Если связи имеют параметры (например, расстояние между комнатами, время перехода), укажите их над рёбрами. Тогда граф будет взвешенным.",
  "Посмотрите на получившуюся модель как на отдельную структуру — отвлекитесь от реальной квартиры и взгляните на неё как на граф.",
  "Изучите свойства графа: попробуйте представить маршруты (например, путь от входной двери до спальни), определите, какие комнаты связаны напрямую, а какие — через промежуточные.",
  "Подумайте, какие изменения можно внести в граф: например, добавление новой комнаты, изменение связей, удаление двери и т.д. Обратите внимание, как это влияет на структуру и маршруты."
],
  "reflection_questions": [
    "Какие шаги были наиболее сложными при построении графа?",
    "Могли ли вы ошибиться при интерпретации структуры данных? Почему?",
    "Как можно автоматизировать этот процесс?"
  ],
  "additional_materials": [
    "План вашей квартиры, пусть даже мысленный. В ней вы ориентируетесь хорошо."
  ],
  "final_conclusion": [
    "Вы научились создавать модель графа для связанных между собой отношениями объектов.",
    "Теперь вы можете применять полученные навыки при решении задач на графы.",
    "Дальнейшая практика поможет вам быстрее распознавать и строить сложные графы."
  ]
}
