{
  "title": "Изображение графа на основе списка смежности",
  "goals": [
    "Научиться правильно интерпретировать структуры данных, чтобы представлять себе, как связаны вершины графа друг с другом"
  ],
  "training_topic": "Интерпретация списков смежности, работа с графовыми структурами данных, создание графических изображений вручную.",
  "required_resources": [
    "Ручка и бумага",
    "Базовые знания теории графов"
  ],
  "instructions": [
    "Ознакомьтесь с предоставленной структурой данных — списком смежности, который описывает связи между вершинами графа. Вначале мы создадим неориентированный граф",
    "Прочтите определение списка смежности.",
    "Начните рисовать вершины графа, обозначив каждую цифрой, соответствующей ключу в списке смежности.",
    "Проведите линии (рёбра) между вершинами, основываясь на связях, указанных в списке смежности.",
    "Постарайтесь расположить вершины таким образом, чтобы минимизировать пересечения линий и обеспечить ясность восприятия структуры графа.",
    "Проверьте свою схему, сравнив её с исходными данными, чтобы убедиться в правильности соединения вершин.",
    "Сделайте пометки возле рёбер или вершин, если это помогает лучше понять структуру графа.",
    "Теперь рядом мы создадим ориентированный граф. Вновь ознакомьтесь с представленной структурой данных. Каждое свойство содержит массив вершин. Свойство представляет из себя направление отношения к вершинам представленным в массиве.",
    "Проведите линии (рёбра) между вершинами, основываясь на связях, указанных в списке смежности."
  ],
  "reflection_questions": [
    "Какие особенности вашей схемы позволяют легче воспринимать структуру графа?",
    "Может ли изменение порядка вершин повлиять на удобство восприятия схемы?",
    "Какие недостатки вашего подхода могли бы привести к путанице при чтении графа?"
  ],
  "additional_materials": [
    {
      "type": "json",
      "title": "Список смежности",
      "name": "1",
      "folder": "3",
      "chapter": "3.3"
    },
    "Список смежности — это способ представления графа, при котором каждая вершина ассоциируется с набором её соседей, то есть вершин, с которыми она непосредственно связана рёбрами. Индекс элемента соответствует номеру вершины, а значение элемента представляет собой перечень номеров всех вершин, соединённых ребром с данной вершиной."
  ],
  "final_conclusion": [
    "Вы познакомились с понятием списка смежности и научились строить графические модели на его основе.",
    "Убедились, что правильное расположение вершин улучшает воспринимаемость графа.",
    "Освоили способ интерпретации абстрактных данных и перевода их в визуально удобную форму."
  ]
}