{
  "title": "Построение взвешенного графа городов России",
  "goals": [
    "Практическое освоение визуализации графа с весами.",
    "Развитие навыков работы с графами и распределения весов.",
    "Тренировка анализа и интерпретации структуры данных."
  ],
  "training_topic": "Визуализация графа, обучение работе с вершинами и рёбрами.",
  "required_resources": [
    "Объект, представляющий граф городов России.",
    "Бумага и карандаш (для рисования графа)."
  ],
  "instructions": [
    "Подготовка к выполнению упражнения:",
    "- Ознакомьтесь с объектом графа, представляющим расстояния между городами России.",
    "",
    "Шаг 1. Выбор начальной точки:",
    "- Выберите Москву в качестве стартовой вершины и нарисуйте её в центре листа бумаги.",
    "",
    "Шаг 2. Построение рёбер и распределение весов:",
    "- Соедини Москву прямыми линиями с остальными городами, указанными в объекте, и около каждой линии укажите расстояние (вес ребра). Например, Москва → Санкт-Петербург (715 км).",
    "",
    "Шаг 3. Дальнейшее развертывание графа:",
    "- Постепенно добавляйте города, относящиеся ко второму уровню, исходя из объекта графа. Например, Казань, Самара, Екатеринбург и т.д., рисуя их вокруг Москвы и проводя рёбра, обозначающие расстояния.",
    "",
    "Шаг 4. Завершение построения графа:",
    "- Полностью достройте граф, последовательно добавляя города и расставляя расстояния между ними, соблюдая логику данных в объекте.",
    "",
    "Шаг 5. Оформление и анализ графа:",
    "- Нанесите названия городов и расстояния на рисунок.",
    "- Проверьте точность своей визуализации, сравнив с исходным объектом.",
    "",
    "Заключение:",
    "- Ваш граф наглядно иллюстрирует расстояния между крупными городами России, демонстрируя сеть дорог и расстояния между пунктами."
  ],
  "reflection_questions": [
    "Какие города расположены ближе всего к Москве, судя по вашему графу?",
    "Как граф помогает быстро оценить расстояния между отдалёнными регионами страны?",
    "Можно ли дополнить граф дополнительной информацией, например, транспортными маршрутами или видами транспорта?"
  ],
  "additional_materials": [
    {
      "type": "json",
      "title": "Граф представленный в виде структуры данных",
      "name": "1",
      "folder": "4",
      "chapter": "3.3"
    },
    "Книга «Теория графов и сетей»: глава о визуализации графов.",
    "Инструмент онлайн-визуализации графов (Graphviz, yEd Graph Editor)."
  ],
  "final_conclusion": [
    "Вы освоили построение и визуализацию графа, продемонстрировав понимание расстояний между городами России.",
    "Такая техника полезна для анализа и планирования маршрутов, оценки транспортной инфраструктуры и логистических решений."
  ]
}