{
  "title": "Создание матрицы смежности на основе взвешенного DAG",
  "goals": [
    "Практическое освоение построения матриц смежности для взвешенных направленных ациклических графов (DAG).",
    "Закрепление понимания работы с графами и весами рёбер."
  ],
  "training_topic": "Матрицы смежности, работа с направленными ациклическими графами, моделирование структуры данных.",
  "required_resources": [
    "Изображение графа DAG с весами (предоставляется преподавателем).",
    "Редактор кода (VS Code, Sublime Text и т.д.)."
  ],
  "instructions": [
    "Введение в упражнение:",
    "- Направленный ациклический граф (DAG) — это граф, в котором рёбра направлены и не образуют циклов. Матрица смежности — это эффективный способ представления графа, особенно когда важна скорость доступа к рёбрам и их весам.",
    "",
    "Шаг 1. Анализ изображения графа:",
    "- Изучите предоставленное изображение DAG, обратите внимание на вершины, рёбра и их веса.",
    "",
    "Шаг 2. Построение матрицы смежности:",
    "- Исходя из количества вершин, создайте двумерный массив соответствующего размера.",
    "- Заполните ячейки матрицы нулями, обозначающими отсутствие рёбер.",
    "- Для каждого ребра на изображении заполните ячейку, соответствующую началу и концу ребра, значением равным весу этого ребра.",
    "",
    "Шаг 3. Принятие решения о размере матрицы:",
    "- Количество строк и столбцов матрицы должно соответствовать количеству вершин в графе.",
    "",
    "Шаг 4. Завершение построения матрицы:",
    "- Убедитесь, что ваша матрица корректно отражает граф, представленные на изображении.",
    "",
    "Пример матрицы смежности (на основе изображения графа):",
    {
      "type": "code",
      "title": "Пример матрицы смежности для графа DAG",
      "code": "const graphMatrix = [ [0, 5, 0, 0], [0, 0, 3, 2], [0, 0, 0, 4], [0, 0, 0, 0] ];",
      "description": "Данная матрица смежности описывает граф с 4 вершинами"
    },
    "",
    "Заключение:",
    "- Вы построили матрицу смежности для DAG, продемонстрировав понимание работы с графами и рёбрами с весами."
  ],
  "reflection_questions": [
    "Почему матрица смежности предпочтительнее списка смежности для небольших плотных графов?",
    "Какие сложности могут возникнуть при работе с большими разреженными графами?",
    "Как можно оптимизировать хранение матрицы смежности для экономии памяти?"
  ],
  "additional_materials": [
    {
      "type": "image",
      "title": "Взвешенный DAG",
      "name": "1",
      "folder": "6",
      "chapter": "3.3"
    },
    "Книга «Совершенный алгоритм. Графовые алгоритмы и структуры данных» изд-во Питер — глава 'Матрица смежности'.",
    "Документация MDN по работе с массивами в JavaScript: https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array"
  ],
  "final_conclusion": [
    "Вы освоили создание матриц смежности для взвешенных DAG, пополнив свои знания и навыки в области графов и структур данных."
  ]
}