{
  "title": "Обзор интерфейса ReduxDevTools",
  "goals": [
    "Знакомство со влиянием экшенов на контроль за изменением состояния в ReduxDevTools."
  ],
  "training_topic": "Экшены в ReduxDevTools.",
  "required_resources": [
    "Изображение интерфейса ReduxDevTools.",
    "Расширение ReduxDevTools для браузера (Chrome, Firefox и т.д.)."
  ],
  "instructions": [
    "Введение в упражнение:",
    "- Цель упражнения — познакомиться с интерфейсом ReduxDevTools позволяющим отслеживать каждую сторону изменения состояния в связи с задействованным экшеном.",
    "",
    {
      "type": "image",
      "title": "Панели и области ReduxDevTools",
      "name": "Inspector",
      "folder": "2",
      "chapter": "4.10",
      "format": "png"
    },  
    "Шаг 1. Подготовьте рабочую среду:",
    "- Обновите страницу html (F5). Откройте инструмент ReduxDevTools.",
    "- Включите инструмент Inspector (как показано на рисунке).",
    "- В источниках данных (область 4 на рисунке) выбрать 'State' и затем выбрать подвкладку 'Raw'.",
    "",
    "Шаг 2. Взаимодействие с html-страницей, отправка экшенов и изменение состояния:",
    "- На html-странице нажмите один раз кнопку 'Следующий'.",
    "- В ReduxDevTools в области хронологии экшенов (область 2 на рисунке) появился экшен 'bookAnnouncement/nextBook'.",
    "- А во вкладке 'State', в подвкладке 'Raw' видно изменение состояния.",
    "- Ещё раз нажмите кнопку 'Следующий'.",
    "- И ещё раз отметьте изменения области хронологии экшенов и State.",
    "",
    "Шаг 3. Взаимодействие с областью хронологии экшенов и вкладкой State области источников данных",
    "- Теперь подведите курсор к первому экшену 'bookAnnouncement/nextBook'. Вместо времени у экшена появятся две кнопки: Jump, Skip.",
    "- Нажмите кнопку Jump. Отметьте изменение состояния во вкладке 'State'. Отметьте визуальное изменение второго экшена 'bookAnnouncement/nextBook', он стал серым.",
    "- Теперь подведите курсор ко второму экшену 'bookAnnouncement/nextBook'. Вместо времени у него также появятся две кнопки: Jump, Skip.",
    "- Нажмите кнопку Jump. Отметьте изменение состояния во вкладке 'State'. Отметьте возвращение визуального состояния второго экшена. Он вновь стал контрастным.",
    "- Не убирая курсор со второго экшена 'bookAnnouncement/nextBook', нажмите кнопку Skip.",
    "- Отметьте изменение состояния во вкладке 'State'. Отметьте стилевое и визуальное изменение второго экшена 'bookAnnouncement/nextBook', текст стал зачеркнутым, а цвет фона и текста - серым.",
    "- Нажмите ещё раз кнопку Skip и произойдёт откат к предыдущему виду и состоянию.",
    "",
    "Шаг 4. Взаимодействие с областью хронологии экшенов и вкладкой Action области источников данных",
    "- Переключитесь на вкладку Action области источников данных.",
    "- Вам отобразится объект экшена.",
    "- Выберите теперь в области хронологии экшенов экшен @@INIT и посмотрите какой объект экшена отправляется в стор, когда выбрасывается экшен @@INIT.",
    "",
    "Шаг 4. Взаимодействие с областью хронологии экшенов и вкладкой Diff области источников данных",
    "- В области хронологии экшенов поместите курсор на самый последний экшен.",
    "- Переключитесь на вкладку Diff области источников данных.",
    "- Отметьте, какие изменения в состояние внёс данный экшен.",
    "- Теперь вывберите предыдущий экшен и отметьте изменения.",
    "- Понажимайте ещё на кнопку 'Следующий' и отметьте изменения производимые в состоянии вновь отправленными в стор экшенами.",
    "",
    "Заключение:",
    "- Вы познакомились с тем, как отслеживать каждую сторону изменения состояния в связи с задействованным экшеном в ReduxDevTools."
  ],
  "reflection_questions": [
    "Какие элементы интерфейса ReduxDevTools помогли вам лучше понять работу приложения?",
    "Какие инструменты обзора данных кажутся наиболее полезными?",
    "Какие функции ReduxDevTools облегчают диагностику и отладку приложений?"
  ],
  "additional_materials": [
    "Документация ReduxDevTools: https://github.com/reduxjs/redux-devtools"
  ],
  "final_conclusion": [
    "Вы освоили основные элементы интерфейса ReduxDevTools."
  ]
}